# Найдите результат выражения для заданных значений aa и bb. Учитывайте регистр символов при ответе.

a = True
b = False
a and b or not a and not b

print(a and b or not a and not b)
