# Выведите таблицу размером n×n, заполненную числами от 1 до n2 по спирали,
# выходящей из левого верхнего угла и закрученной по часовой стрелке,
# как показано в примере (здесь n=5).

n = int(input())
a = [[0 for j in range(n)] for l in range(n)]
m = 0
t = n
k = 0
s = 0
i = 1
while m <= int(n / 2) + 1:
    s += 4 * t - 4
    while i <= s:  # Один круг
        if i <= t + k:  # В k хранится номер последнего элемента в одной итерации, в t хранится размер квадрата
            a[m][(i-k)+m-1] = i
        elif (t + k) + 1 <= i <= (2 * t + k) - 1:
            a[(i-k)+m-t][n-m-1] = i
        elif 2 * t + k <= i <= 3 * t + k - 2:
            a[t+m-1][(-((i-k)+1)%t)+m-1] = i
        elif 3 * t + k - 1 <= i <= 4 * t + k - 4:
            a[(-(i-k)+t-3)%t+m][m] = i
        i += 1
    k += 4 * t - 4
    t -= 2
    m += 1
if n % 2 == 1:
    a[int((n+1)/2)-1][int((n+1)/2)-1] = n**2
for i in range(n):
    for j in range(n):
        print(a[i][j], end="\t")
    print()

# Матрица поворота - поворот вектора заполнения матрицы на 90 градусов: dx,dy=(-dy,dx)


